Revit 2024 API
AnalysisDisplayDiagramSettings Constructor (AnalysisDisplayDiagramSettings)
 Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AnalysisDisplayDiagramSettings(
	AnalysisDisplayDiagramSettings other
)
Visual Basic
Public Sub New ( _
	other As AnalysisDisplayDiagramSettings _
)
Visual C++
public:
AnalysisDisplayDiagramSettings(
	AnalysisDisplayDiagramSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayDiagramSettings Class
AnalysisDisplayDiagramSettings Overload
Autodesk.Revit.DB.Analysis Namespace